In [ ]:
# SELECT PRACTICE

In [ ]:
#/* select all columns (and rows) from table "employees" in "alanparadise/nw" 
#*/
SELECT * FROM "alanparadise/nw". "employees";

In [ ]:
#/* select columns  productid, productname, quantity per unit, unitprice, and unitsinstock 
#from table "products" in  "alanparadise/nw" 
#*/
SELECT productid, productname, quantityperunit, unitprice, unitsinstock
FROM "alanparadise/nw". "products";

In [ ]:
# /* select concatenate firstname and lastname,
#    function = year when hired 
# from table employees in "alanparadise/nw"
# */

SELECT firstname || ' ' || lastname as "Name",
    to_char(hiredate, 'year') as "Hire Year"
FROM "alanparadise/nw"."employees"; 

#/* select concatenate firstname and lastname,
#    function = year when hired 
#from table employees in "alanparadise/nw"
#*/

SELECT CONCAT(firstname,' ', lastname) as "Name",
    to_char(hiredate, 'year') as "Hire Year"
FROM "alanparadise/nw"."employees";

In [ ]:
#/* select productname, unitprice, unitsinstock,
#    function = total value= unitsinstock*unitprice
#from table products in "alanparadise/nw"
#*/
SELECT productname, unitprice, unitsinstock,
    unitsinstock*unitprice as "Total Value"
FROM "alanparadise/nw"."products";

In [ ]:
#/* select concatenate(firstname,' ', lastname) as "Name",
#    function = to_char(birthdate, 'month') as "Birthday Month"
#from table employees in "alanparadise/nw"
#*/

SELECT firstname || ' ' || lastname as "Name",
    to_char(birthdate, 'month') as "Birthday Month"
FROM "alanparadise/nw"."employees";

In [ ]:
# Week 2: Lab 2
# SELECT STATEMENT

In [ ]:
# /* select columns  customerid, companyname, country
# from table 'customers' in "alanparadise/nw"
#     where condition on columns(NOT):
#     NOT country  = 'USA'
# */
SELECT customerid, companyname, country
FROM "alanparadise/nw"."customers"
    WHERE NOT country = 'USA';

In [ ]:
# /* 
# select columns  productname, unitprice, unitsinstock,
#     function:  unitsinstock*uniprice as "totalvalue"
# from table 'products' in "alanparadise/nw"
#    where condition on columns(>):
#     totalvalue > 100
# */
SELECT productname, unitprice, unitsinstock,
    unitsinstock*unitprice as "totalvalue"
FROM "alanparadise/nw"."products"
    WHERE unitsinstock*unitprice > 100;

In [ ]:
# /* 
# select columns  productid, productname, quantityperunit
# from table 'products' in "alanparadise/nw"
#     where condition on columns(like  '%jars%', has word):
#     quantityperunit like '%jars%';
# */

SELECT productid, productname, quantityperunit 
    FROM "alanparadise/nw"."products"
    WHERE quantityperunit like '%jars%';

In [ ]:
# /* 
# select columns  productid, productname, unitprice
# from table 'products' in "alanparadise/nw"
#     where condition on columns(in):
#     categoryid in (1, 3, 5, 7);
# */

SELECT productid, productname, unitprice, categoryid
FROM "alanparadise/nw"."products"
    WHERE categoryid in (1, 3, 5, 7);

In [ ]:
# /* 
# select columns  orderid,  customerid, shippeddate
# from table 'orders' in "alanparadise/nw"
#     where condition on columns(between):
#     shippeddate between 1996-12-01 and 1997-01-31
# */

SELECT orderid,  customerid, shippeddate
FROM "alanparadise/nw"."orders"
    WHERE shippeddate between '1996-12-01' and '1997-01-31' AND
    shipcountry = 'Canada';

In [ ]:
# import libraries
import sqlite3 as sql

In [ ]:
conn = sql.connect('database1.sqlite')
cur = conn.cursor()

In [ ]:
# /* select concatenate(firstname,' ', lastname) as "Employee",
#     function: age(hiredate, birthdate)::text as "Hire age"
# from table 'employee' in "alanparadise/nw";
# */

SELECT employeeid, CONCAT(firstname,' ', lastname) as "Employee",
    CAST(age(hiredate, birthdate)::text)  as "Hire age"
FROM "alanparadise/nw"."employees";

In [ ]:
# /* select cast(convert) age difference between today's date and birthday, as text
# /*
SELECT CAST(age(now(),'1998-03-22')as text);

In [ ]:
# /* select customerid, companyname, country
# from table 'customers' in "alanparadise/nw"
#     where condition on columns (NULL):
#     region = NULL;
# */

SELECT customerid, companyname, country
FROM "alanparadise/nw"."customers"
    WHERE region is NULL;

In [ ]:
# commit SQL commands
conn.commit()

# close SQL handle
cur.close()